Revit 2024 API
InternalDefinition Properties
The InternalDefinition type exposes the following members.
Properties
Name | Description
BuiltInParameter
 Tests whether this definition identifies a built-in parameter or not.
Id
 The id of the parameter.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
The user-visible name for the parameter.
 (Overrides Definition.Name.)
ParameterGroup |  Obsolete.
 Id of a built-in parameter group to which the parameter defined by this definition belongs.
 (Overrides Definition.ParameterGroup.)
VariesAcrossGroups
Whether or not the parameter values can vary across group members.
Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace